In [1]:
import pandas as pd

In [4]:
data = [[0, 95, 100, 105], [1, 70, None, 80]]
products = pd.DataFrame(data, columns=['product_id', 'store1', 'store2', 'store3']).astype({'product_id':'Int64', 'store1':'Int64', 'store2':'Int64', 'store3':'Int64'})

In [5]:
products

   product_id  store1  store2  store3
0           0      95     100     105
1           1      70    <NA>      80

In [6]:
def rearrange_products_table(products: pd.DataFrame) -> pd.DataFrame:
    melted = products.melt(id_vars=['product_id'], value_vars=['store1', 'store2', 'store3'], var_name='store', value_name='price')
    
    melted = melted.dropna(subset=['price'])
    
    return melted[['product_id', 'store', 'price']]

In [7]:
rearranged_products = rearrange_products_table(products)

In [8]:
rearranged_products

   product_id   store  price
0           0  store1     95
1           1  store1     70
2           0  store2    100
4           0  store3    105
5           1  store3     80